In [2]:
import pandas as pd

In [3]:
data =pd.read_csv('Max_temp.csv')

In [4]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings("ignore")

In [5]:
data.head()

,Year,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec,Unnamed: 13
0,1901,9.65,11.38,16.27,20.56,23.29,25.00,23.68,22.61,22.00,19.52,14.28,10.93,NaN
1,1902,11.17,12.61,17.71,21.02,23.80,24.62,23.50,23.47,21.59,18.73,13.62,10.38,NaN
2,1903,10.34,11.57,15.54,20.21,22.93,24.90,23.84,22.73,21.83,18.53,13.20,10.00,NaN
3,1904,10.11,12.07,15.90,21.22,23.08,23.75,22.70,22.69,21.60,18.75,13.54,10.71,NaN
4,1905,9.24,10.28,14.63,18.76,23.72,25.21,23.45,23.12,21.86,19.01,14.63,10.50,NaN

In [12]:
data=data[["Year","Jan","Feb","Mar","Apr","May","Jun","Jul","Aug","Sep","Oct","Nov","Dec"]]
data.head()

,Year,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec
0,1901,9.65,11.38,16.27,20.56,23.29,25.00,23.68,22.61,22.00,19.52,14.28,10.93
1,1902,11.17,12.61,17.71,21.02,23.80,24.62,23.50,23.47,21.59,18.73,13.62,10.38
2,1903,10.34,11.57,15.54,20.21,22.93,24.90,23.84,22.73,21.83,18.53,13.20,10.00
3,1904,10.11,12.07,15.90,21.22,23.08,23.75,22.70,22.69,21.60,18.75,13.54,10.71
4,1905,9.24,10.28,14.63,18.76,23.72,25.21,23.45,23.12,21.86,19.01,14.63,10.50

In [13]:
data.count()

Year    121
Jan     121
Feb     121
Mar     121
Apr     121
May     121
Jun     121
Jul     121
Aug     121
Sep     121
Oct     121
Nov     121
Dec     121
dtype: int64

In [14]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 121 entries, 0 to 120
Data columns (total 13 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Year    121 non-null    int64
 1   Jan     121 non-null    float64
 2   Feb     121 non-null    float64
 3   Mar     121 non-null    float64
 4   Apr     121 non-null    float64
 5   May     121 non-null    float64
 6   Jun     121 non-null    float64
 7   Jul     121 non-null    float64
 8   Aug     121 non-null    float64
 9   Sep     121 non-null    float64
 10  Oct     121 non-null    float64
 11  Nov     121 non-null    float64
 12  Dec     121 non-null    float64
dtypes: float64(12), int64(1)
memory usage: 12.4 KB

In [15]:
data.isnull().sum()

Year    0
Jan     0
Feb     0
Mar     0
Apr     0
May     0
Jun     0
Jul     0
Aug     0
Sep     0
Oct     0
Nov     0
Dec     0
dtype: int64

In [16]:
data=data.fillna(data.mean())

In [17]:
data.isnull().sum()

Year    0
Jan     0
Feb     0
Mar     0
Apr     0
May     0
Jun     0
Jul     0
Aug     0
Sep     0
Oct     0
Nov     0
Dec     0
dtype: int64

In [19]:
data.rename(columns={"Jan":1,"Feb":2,"Mar":3,"Apr":4,"May":5,"Jun":6,"Jul":7,"Aug":8,"Sep":9,"Oct":10,"Nov":11,"Dec":12}, inplace = True)

In [20]:
data.head()

,Year,1,2,3,4,5,6,7,8,9,10,11,12
0,1901,9.65,11.38,16.27,20.56,23.29,25.00,23.68,22.61,22.00,19.52,14.28,10.93
1,1902,11.17,12.61,17.71,21.02,23.80,24.62,23.50,23.47,21.59,18.73,13.62,10.38
2,1903,10.34,11.57,15.54,20.21,22.93,24.90,23.84,22.73,21.83,18.53,13.20,10.00
3,1904,10.11,12.07,15.90,21.22,23.08,23.75,22.70,22.69,21.60,18.75,13.54,10.71
4,1905,9.24,10.28,14.63,18.76,23.72,25.21,23.45,23.12,21.86,19.01,14.63,10.50

In [22]:
windspeed=pd.read_csv("windspeed.csv")
windspeed.head()

,Unnamed: 0,YEAR,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC
0,0,1901,17.99,19.43,23.49,26.41,28.28,28.60,27.49,26.98,26.26,25.08,21.73,18.95
1,1,1902,19.00,20.39,24.10,26.54,28.68,28.44,27.29,27.05,25.95,24.37,21.33,18.78
2,2,1903,18.32,19.79,22.46,26.03,27.93,28.41,28.04,26.63,26.34,24.57,20.96,18.29
3,3,1904,17.77,19.39,22.95,26.73,27.83,27.85,26.84,26.73,25.84,24.36,21.07,18.84
4,4,1905,17.40,17.79,21.78,24.84,28.32,28.69,27.67,27.47,26.29,26.16,22.07,18.71

In [23]:
windspeed.count()

Unnamed: 0    117
YEAR          117
JAN           117
FEB           117
MAR           117
APR           117
MAY           117
JUN           117
JUL           117
AUG           117
SEP           117
OCT           117
NOV           117
DEC           117
dtype: int64

In [24]:
windspeed.isnull().sum()

Unnamed: 0    0
YEAR          0
JAN           0
FEB           0
MAR           0
APR           0
MAY           0
JUN           0
JUL           0
AUG           0
SEP           0
OCT           0
NOV           0
DEC           0
dtype: int64

In [25]:
windspeed.rename(columns={"Year":"Year","Jan":1,"Feb":2,"Mar":3,"Apr":4,"May":5,"Jun":6,"Jul":7,"Aug":8,"Sep":9,"Oct":10,"Nov":11,"Dec":12}, inplace = True)
windspeed.head()

,Unnamed: 0,YEAR,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC
0,0,1901,17.99,19.43,23.49,26.41,28.28,28.60,27.49,26.98,26.26,25.08,21.73,18.95
1,1,1902,19.00,20.39,24.10,26.54,28.68,28.44,27.29,27.05,25.95,24.37,21.33,18.78
2,2,1903,18.32,19.79,22.46,26.03,27.93,28.41,28.04,26.63,26.34,24.57,20.96,18.29
3,3,1904,17.77,19.39,22.95,26.73,27.83,27.85,26.84,26.73,25.84,24.36,21.07,18.84
4,4,1905,17.40,17.79,21.78,24.84,28.32,28.69,27.67,27.47,26.29,26.16,22.07,18.71

In [27]:
pressure=pd.read_csv("Pressure.csv")
pressure.head()

,DIVISION,YEAR,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,ANNUAL,Jan-Feb,Mar-May,Jun-Sep,Oct-Dec
0,ANDAMAN & NICOBAR ISLANDS,1901,49.2,87.1,29.2,2.3,528.8,517.5,365.1,481.1,332.6,388.5,558.2,33.6,3373.2,136.3,560.3,1696.3,980.3
1,ANDAMAN & NICOBAR ISLANDS,1902,0.0,159.8,12.2,0.0,446.1,537.1,228.9,753.7,666.2,197.2,359.0,160.5,3520.7,159.8,458.3,2185.9,716.7
2,ANDAMAN & NICOBAR ISLANDS,1903,12.7,144.0,0.0,1.0,235.1,479.9,728.4,326.7,339.0,181.2,284.4,225.0,2957.4,156.7,236.1,1874.0,690.6
3,ANDAMAN & NICOBAR ISLANDS,1904,9.4,14.7,0.0,202.4,304.5,495.1,502.0,160.1,820.4,222.2,308.7,40.1,3079.6,24.1,506.9,1977.6,571.0
4,ANDAMAN & NICOBAR ISLANDS,1905,1.3,0.0,3.3,26.9,279.5,628.7,368.7,330.5,297.0,260.7,25.4,344.7,2566.7,1.3,309.7,1624.9,630.8

In [28]:
pressure.count()

DIVISION    4116
YEAR        4116
JAN         4112
FEB         4113
MAR         4110
APR         4112
MAY         4113
JUN         4111
JUL         4109
AUG         4112
SEP         4110
OCT         4109
NOV         4105
DEC         4106
ANNUAL      4090
Jan-Feb     4110
Mar-May     4107
Jun-Sep     4106
Oct-Dec     4103
dtype: int64

In [29]:
pressure.isnull().sum()

DIVISION     0
YEAR         0
JAN          4
FEB          3
MAR          6
APR          4
MAY          3
JUN          5
JUL          7
AUG          4
SEP          6
OCT          7
NOV         11
DEC         10
ANNUAL      26
Jan-Feb      6
Mar-May      9
Jun-Sep     10
Oct-Dec     13
dtype: int64

In [30]:
pressure.rename(columns={"Year":"Year","Jan":1,"Feb":2,"Mar":3,"Apr":4,"May":5,"Jun":6,"Jul":7,"Aug":8,"Sep":9,"Oct":10,"Nov":11,"Dec":12}, inplace = True)
pressure.head()

,DIVISION,YEAR,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,ANNUAL,Jan-Feb,Mar-May,Jun-Sep,Oct-Dec
0,ANDAMAN & NICOBAR ISLANDS,1901,49.2,87.1,29.2,2.3,528.8,517.5,365.1,481.1,332.6,388.5,558.2,33.6,3373.2,136.3,560.3,1696.3,980.3
1,ANDAMAN & NICOBAR ISLANDS,1902,0.0,159.8,12.2,0.0,446.1,537.1,228.9,753.7,666.2,197.2,359.0,160.5,3520.7,159.8,458.3,2185.9,716.7
2,ANDAMAN & NICOBAR ISLANDS,1903,12.7,144.0,0.0,1.0,235.1,479.9,728.4,326.7,339.0,181.2,284.4,225.0,2957.4,156.7,236.1,1874.0,690.6
3,ANDAMAN & NICOBAR ISLANDS,1904,9.4,14.7,0.0,202.4,304.5,495.1,502.0,160.1,820.4,222.2,308.7,40.1,3079.6,24.1,506.9,1977.6,571.0
4,ANDAMAN & NICOBAR ISLANDS,1905,1.3,0.0,3.3,26.9,279.5,628.7,368.7,330.5,297.0,260.7,25.4,344.7,2566.7,1.3,309.7,1624.9,630.8

In [31]:
nt=pd.DataFrame({"pressure":[],"windspeed":[],"rainfall":[]})
nt

Empty DataFrame
Columns: [pressure, windspeed, rainfall]
Index: []

In [36]:
asp=pd.DataFrame({"pressure":[]})
asp

Empty DataFrame
Columns: [pressure]
Index: []

In [38]:
nt.count()

pressure     0
windspeed    0
rainfall     0
dtype: int64

In [39]:
nt.dtypes

pressure     float64
windspeed    float64
rainfall     float64
dtype: object